export default {
  projections: {
    ДоговорE: {
      датаЗаключ: {
        __caption__: 'Дата заключ'
      },
      датаОконч: {
        __caption__: 'Дата оконч'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      обязанПосред: {
        __caption__: 'Обязан посред'
      }
    },
    ДоговорL: {
      датаЗаключ: {
        __caption__: 'Дата заключ'
      },
      организация: {
        __caption__: '',
        наименование: {
          __caption__: ''
        }
      },
      рукОтдЛог: {
        __caption__: '',
        персонал: {
          __caption__: '',
          фИО: {
            __caption__: ''
          }
        }
      },
      контрагент: {
        __caption__: '',
        организация: {
          __caption__: ''
        },
        ответсЛицо: {
          __caption__: ''
        }
      },
      датаОконч: {
        __caption__: 'Дата оконч'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      обязанПосред: {
        __caption__: 'Обязан посред'
      }
    }
  },
  validations: {
    датаЗаключ: {
      __caption__: 'Дата заключ'
    },
    датаНачала: {
      __caption__: 'Дата начала'
    },
    датаОконч: {
      __caption__: 'Дата оконч'
    },
    обязанПосред: {
      __caption__: 'Обязан посред'
    },
    контрагент: {
      __caption__: 'контрагент'
    },
    организация: {
      __caption__: 'организация'
    },
    рукОтдЛог: {
      __caption__: 'рукОтдЛог'
    }
  }
};
